yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af528a.h
#define LINUART_CR4_ADD          LINUART_CR4_bit.ADD
#define LINUART_CR4_LBDF         LINUART_CR4_bit.LBDF
#define LINUART_CR4_LBDL         LINUART_CR4_bit.LBDL
#define LINUART_CR4_LBDIEN       LINUART_CR4_bit.LBDIEN

#define LINUART_CR6_LSF          LINUART_CR6_bit.LSF
#define LINUART_CR6_LHDF         LINUART_CR6_bit.LHDF
#define LINUART_CR6_LHDIEN       LINUART_CR6_bit.LHDIEN
#define LINUART_CR6_LASE         LINUART_CR6_bit.LASE
#define LINUART_CR6_LSLV         LINUART_CR6_bit.LSLV
#define LINUART_CR6_LDUM         LINUART_CR6_bit.LDUM

#endif

/*-------------------------------------------------------------------------
 *      LINUART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_LINUART_SR_PE       0x01
#define MASK_LINUART_SR_FE       0x02
#define MASK_LINUART_SR_NF       0x04
#define MASK_LINUART_SR_LHE      0x08
#define MASK_LINUART_SR_IDLE     0x10
#define MASK_LINUART_SR_RXNE     0x20
#define MASK_LINUART_SR_TC       0x40
#define MASK_LINUART_SR_TXE      0x80

#define MASK_LINUART_CR1_PIEN    0x01
#define MASK_LINUART_CR1_PS      0x02
#define MASK_LINUART_CR1_PCEN    0x04
#define MASK_LINUART_CR1_WAKE    0x08
#define MASK_LINUART_CR1_M       0x10
#define MASK_LINUART_CR1_UARTD   0x20
#define MASK_LINUART_CR1_T8      0x40
#define MASK_LINUART_CR1_R8      0x80

#define MASK_LINUART_CR2_SBK     0x01
#define MASK_LINUART_CR2_RWU     0x02
#define MASK_LINUART_CR2_REN     0x04
#define MASK_LINUART_CR2_TEN     0x08
#define MASK_LINUART_CR2_ILIEN   0x10
#define MASK_LINUART_CR2_RIEN    0x20
#define MASK_LINUART_CR2_TCIEN   0x40
#define MASK_LINUART_CR2_TIEN    0x80

#define MASK_LINUART_CR3_STOP    0x30
#define MASK_LINUART_CR3_LINEN   0x40

#define MASK_LINUART_CR4_ADD     0x0F
#define MASK_LINUART_CR4_LBDF    0x10
#define MASK_LINUART_CR4_LBDL    0x20
#define MASK_LINUART_CR4_LBDIEN  0x40

#define MASK_LINUART_CR6_LSF     0x01
#define MASK_LINUART_CR6_LHDF    0x02
#define MASK_LINUART_CR6_LHDIEN  0x04
#define MASK_LINUART_CR6_LASE    0x10
#define MASK_LINUART_CR6_LSLV    0x20
#define MASK_LINUART_CR6_LDUM    0x80


/*-------------------------------------------------------------------------
 *      TIM1 register definitions
 *-----------------------------------------------------------------------*/
/* TIM1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM1_CR1;
#endif
__IO_REG8_BIT(TIM1_CR1,    0x5250, __READ_WRITE, __BITS_TIM1_CR1);

/* TIM1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCPC        : 1;
  unsigned char             : 1;
  unsigned char COMS        : 1;
  unsigned char             : 1;
  unsigned char MMS         : 3;
  unsigned char TI1S        : 1;
} __BITS_TIM1_CR2;
#endif
__IO_REG8_BIT(TIM1_CR2,    0x5251, __READ_WRITE, __BITS_TIM1_CR2);

/* TIM1 slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM1_SMCR;
#endif
__IO_REG8_BIT(TIM1_SMCR,   0x5252, __READ_WRITE, __BITS_TIM1_SMCR);

/* TIM1 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM1_ETR;
#endif
__IO_REG8_BIT(TIM1_ETR,    0x5253, __READ_WRITE, __BITS_TIM1_ETR);

/* TIM1 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char CC3IE       : 1;
  unsigned char CC4IE       : 1;
  unsigned char COMIE       : 1;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM1_IER;
#endif
__IO_REG8_BIT(TIM1_IER,    0x5254, __READ_WRITE, __BITS_TIM1_IER);

/* TIM1 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char CC3IF       : 1;
  unsigned char CC4IF       : 1;
  unsigned char COMIF       : 1;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM1_SR1;
#endif
__IO_REG8_BIT(TIM1_SR1,    0x5255, __READ_WRITE, __BITS_TIM1_SR1);

/* TIM1 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
  unsigned char CC3OF       : 1;
  unsigned char CC4OF       : 1;
} __BITS_TIM1_SR2;
#endif
__IO_REG8_BIT(TIM1_SR2,    0x5256, __READ_WRITE, __BITS_TIM1_SR2);

/* TIM1 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char CC3G        : 1;
  unsigned char CC4G        : 1;
  unsigned char COMG        : 1;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM1_EGR;
#endif
__IO_REG8_BIT(TIM1_EGR,    0x5257, __WRITE, __BITS_TIM1_EGR);

/* TIM1 capture/compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
  unsigned char OC1CE       : 1;
} __BITS_TIM1_CCMR1;
#endif
__IO_REG8_BIT(TIM1_CCMR1,  0x5258, __READ_WRITE, __BITS_TIM1_CCMR1);

/* TIM1 capture/compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
  unsigned char OC2CE       : 1;
} __BITS_TIM1_CCMR2;
#endif
__IO_REG8_BIT(TIM1_CCMR2,  0x5259, __READ_WRITE, __BITS_TIM1_CCMR2);

/* TIM1 capture/compare mode register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3S        : 2;
  unsigned char OC3FE       : 1;
  unsigned char OC3PE       : 1;
  unsigned char OC3M        : 3;
  unsigned char OC3CE       : 1;
} __BITS_TIM1_CCMR3;
#endif
__IO_REG8_BIT(TIM1_CCMR3,  0x525A, __READ_WRITE, __BITS_TIM1_CCMR3);

/* TIM1 capture/compare mode register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC4S        : 2;
  unsigned char OC4FE       : 1;
  unsigned char OC4PE       : 1;
  unsigned char OC4M        : 3;
  unsigned char OC4CE       : 1;
} __BITS_TIM1_CCMR4;
#endif
__IO_REG8_BIT(TIM1_CCMR4,  0x525B, __READ_WRITE, __BITS_TIM1_CCMR4);

/* TIM1 capture/compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char CC1NE       : 1;
  unsigned char CC1NP       : 1;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
  unsigned char CC2NE       : 1;
  unsigned char CC2NP       : 1;
} __BITS_TIM1_CCER1;
#endif
__IO_REG8_BIT(TIM1_CCER1,  0x525C, __READ_WRITE, __BITS_TIM1_CCER1);

